[
    {
        "url": "https://www.androidcentral.com/wearables/oakley-meta-vanguard-vs-oakley-meta-hstn",
        "title": "Oakley Meta Vanguard vs Oakley Meta HSTN: One for sports, one for everyday wear",
        "authors": "Brady Snyder",
        "publish_date": "2025-09-30",
        "summary": "Oakley Meta Vanguard Check Amazon For hardcore athletes Oakley Meta Vanguard takes an iconic Oakley style (Sphaera) designed for athletes and adds Meta's fantastic tech package to it.\nThen, at Meta Connect 2025, we got Oakley Meta Vanguard, which added Meta tech to Oakley's athletic Sphaera sunglasses.\nOakley Meta Vanguard vs Oakley Meta HSTN: Design(Image credit: Michael Hicks / Android Central)Both the Oakley Meta Vanguard and Oakley Meta HSTN smart glasses have unique and somewhat controversial designs.\nOakley Meta Vanguard vs Oakley Meta HSTN: Hardware and specs(Image credit: Michael Hicks / Android Central)From a hardware perspective, Vanguard and HSTN are quite similar.\nOakley Meta Vanguard vs Oakley Meta HSTN: Which should you buy?",
        "text": "Oakley Meta Vanguard Check Amazon For hardcore athletes Oakley Meta Vanguard takes an iconic Oakley style (Sphaera) designed for athletes and adds Meta's fantastic tech package to it. You get a central 3K camera for photos and videos, Garmin Connect integration for workouts, and battery life that'll get you through a marathon. IP67 water and sweat resistance rounds out the rugged experience. Pros 12MP camera that can record 3K videos\n\nIP67 rating against dust and water ingress\n\n9 hours of battery life\n\nLoudest open-ear speakers on Meta smart glasses\n\nMeta AI, Strava, and Garmin Connect integration Cons Large, not suited for everyday wear\n\nGarmin Connect integration limited to certain workout types\n\nNo Transitions or prescription options available\n\nExpensive Oakley Meta HSTN Check Amazon For everyday wear The Oakley Meta HSTN still have a sporty look and a secure fit, but they're more suited for casual users and everyday wear. You get multiple lens options, including prescription and Transitions lenses. There's still eight-hour battery life and the same 3K video camera onboard. Pros Casual and striking look based on Oakley HSTN style\n\nUpgraded 12MP, 3K camera (same as Vanguard)\n\nMore affordable at $399\n\n8-hour battery life Cons Only IPX4-rated (minor water-resistance and no dust-resistance)\n\nNo Garmin Connect or Strava integration\n\nSome prescription limits\n\nMeta is rapidly expanding its lineup of smart glasses, and now, there are multiple Oakley styles to choose from. Oakley Meta HSTN arrived first, bringing longer battery life and better video recording to Oakley's popular HSTN frames. Then, at Meta Connect 2025, we got Oakley Meta Vanguard, which added Meta tech to Oakley's athletic Sphaera sunglasses.\n\nThe question is, if you're an athlete or an Oakley fan, should you go with Vanguard or HSTN? Believe it or not, the choice is pretty easy. If you need a pair of glasses or sunglasses for all-day wear, Oakley Meta HSTN are the way to go. Those who need something exclusive to workouts and fitness, with top-tier Garmin and Strava integration to match, should pick the Oakley Meta Vanguard.\n\nThere is a bit more to it than that, so let's break down all the differences between these two styles of Oakley Meta smart glasses.\n\nOakley Meta Vanguard vs Oakley Meta HSTN: Pricing and availability\n\nWhy you can trust Android Central Our expert reviewers spend hours testing and comparing products and services so you can choose the best for you. Find out more about how we test.\n\n(Image credit: Michael Hicks / Android Central)\n\nOakley Meta Vanguard was announced at Meta Connect and are set for release on Oct. 21, 2025. They're available for pre-order now, starting at $499.99, at Meta, partner retailers, and third-party retailers. You can get Vanguard in Black or White frame colors, and there are currently four lens options available: Prizm 24K (Gold), Prizm Black, Prizm Road (Red/Purple), and Prizm Sapphire.\n\nThe lenses are user-replaceable, and replacements are available starting at $85. Currently, there are no prescription lenses available, either on the first or third-party markets.\n\nMeanwhile, Oakley Meta HSTN launched in July 2025 and is now generally available. Initially, only a limited-edition style costing $499.99 was available; however, styles are now being sold for as low as $399.99. Lens styles include Prizm, Prizm Polarized, Clear, and Transition lenses. Prescription options are available within the supported range of -6.00 to +6.00.\n\nOakley Meta Vanguard vs Oakley Meta HSTN: Design\n\n(Image credit: Michael Hicks / Android Central)\n\nBoth the Oakley Meta Vanguard and Oakley Meta HSTN smart glasses have unique and somewhat controversial designs. They're also based upon popular and longtime Oakley styles — Sphaera and HSTN. So, while tech enthusiasts might not appreciate the Oakley Meta frames, the broader group of mainstream Oakley fans might love them.\n\nVanguard is designed to only be worn in certain situations, like while outdoors or working out. There are no clear, prescription, or Transition lenses available for Vanguard, which further cements the positioning of the smart glasses as outdoor-focused. They are large, with a hinge-to-hinge length of 136mm and a lens height of 59mm.\n\nOakley Meta Vanguard are heavier than the HSTN style, weighing 66 grams. However, they'll likely be more comfortable and secure than the HSTNs. This is because the Vanguard style includes a silicone nose pad for grip and tight arms that'll rest securely against your head.\n\n(Image credit: Nicholas Sutrich / Android Central)\n\nOakley Meta HSTN are more versatile, with a subdued design language compared to Vanguard. They're available in more colors and styles, and support polarized, clear, prescription, and Transition lenses. At 53 grams, the Meta HSTN smart glasses should be more comfortable for all-day wear than the activity-focused Vanguard version.\n\nBoth pairs of smart glasses have the same camera, but Vanguard positions it between the two lenses. This might create a better POV experience for videos. Meanwhile, the HSTN model has the camera positioned beside the right lens. On the left side, there's an LED status indicator that lets others know when you're recording or snapping photos.\n\n(Image credit: Michael Hicks / Android Central)\n\nNotably, the Oakley Meta Vanguard smart glasses are rated for IP67 certification against dust and water ingress. Vanguard is not waterproof, but the IP67 rating is a big step above the IPX4 certification of the Oakley Meta HSTN. Oakley Meta Vanguard should survive splashes, sweat, and even heavy rain, whereas HSTN should be handled more delicately.\n\nOakley Meta Vanguard vs Oakley Meta HSTN: Hardware and specs\n\n(Image credit: Michael Hicks / Android Central)\n\nFrom a hardware perspective, Vanguard and HSTN are quite similar. They both sport the same 12MP ultrawide with a photo resolution of 3024 x 4032 pixels. Both pairs of smart glasses can also record 3K video at 30 FPS, and presumably, Vanguard will have the same or better video stabilization as HSTN. They have 32GB of onboard storage, which translates to over 1,000 photos or over 100 30-second video recordings.\n\nAdditionally, Oakley Meta Vanguard and HSTN have two open-air speakers, but they're not identical. Vanguard's speakers are six decibels louder than the ones inside HSTN, and Meta claims you can hear them in up to 30 MPH winds.\n\nSwipe to scroll horizontally Category Oakley Meta Vanguard Oakley Meta HSTN Camera 12MP Ultrawide 12MP Ultrawide Photo resolution 3024 X 4032 pixels (Portrait only) 3024 X 4032 pixels (Portrait only) Video resolution 3K (~2300 x 3100) at 30 fps (Portrait only) 3K (~2300 x 3100) at 30 fps (Portrait only) Water resistance IP67 IPX4 Speakers Open ear Open ear Interface Touchpad on side, Meta AI for voice and camera Touchpad on side, Meta AI for voice and camera Microphones 5-mic Array 5-mic Array Storage 32GB; about 100+ videos (30 sec) and 1000+ photos 32GB; about 100+ videos (30 sec) and 1000+ photos Connectivity Wi-Fi 6; Bluetooth 5.3 Wi-Fi 6; Bluetooth 5.3 Compatibility iOS; Android iOS; Android Battery Up to 9 hours per charge Up to 8 hours per charge. 50 minutes of record time at 1080p. Charging (glasses) case Up to 36 hours Up to 48 hours Prescription lens support None -6.00 to +4.00 Weight 66g 53g\n\nBoth glasses are compatible with iOS and Android via the Meta AI companion app. They use Bluetooth 5.3 for pairing and Wi-Fi 6 for updates and media transfer. However, in addition to Meta AI features available on both frames, Vanguard gets exclusive integration with Garmin Connect and Strava.\n\nThat means you can ask Meta AI about your stats and progress while working out, if you have Vanguard and a supported watch.\n\n(Image credit: Nicholas Sutrich / Android Central)\n\nIn terms of battery life, expect to get up to eight hours from HSTN and nine from Vanguard. Both glasses come with a charging case, but HSTN gets more hours of total charge time with 48 hours (including case battery). Each case has a USB-C port for charging.\n\nOakley Meta Vanguard vs Oakley Meta HSTN: Which should you buy?\n\n(Image credit: Michael Hicks / Android Central)\n\nRay-Ban Meta smart glasses are generalized for the masses, but the Oakley Meta brand has allowed Meta to specialize a bit. Oakley Meta Vanguard are the pinnacle of specialization — they're set to be absolutely excellent for workouts, training, and fitness, but probably not much else. Like the non-smart Oakley Sphaera sunglasses they're based on, Vanguard is intended to be used outdoors during physical activity, not all-day wear.\n\nThat said, if you're a runner, hiker, or biker who wants smart capabilities on your face, Oakley Meta Vanguard could be your best option. With Meta AI, Garmin Connect, and Strava integration, you can chat with your smart glasses about your pace or progress during your run hands-free. The open-air speakers for music listening and a camera for recording are added bonuses.\n\nFor people who want something sportier than Ray-Ban but more versatile than Vanguard, there's Oakley Meta HSTN. These have many of the same internals as Vanguard but can go more places, with prescription and Transition lenses available."
    },
    {
        "url": "https://www.npr.org/sections/shots-health-news/2025/09/30/nx-s1-5553428/sports-books-betting-gambling-addiction-massachusetts-gamesense",
        "title": "As sports betting explodes, should states set more limits to stop gambling addiction?",
        "authors": "Karen Brown",
        "publish_date": "2025-09-30",
        "summary": "As sports betting explodes, should states set more limits to stop gambling addiction?\nBut that's what Massachusetts state workers try to do every day, amid the clanging bells and flashing lights of the slot machines.\nIf they succeed, they give customers brochures with the state's gambling helpline number and website.\nMeanwhile, the state's Department of Public Health puts its own moderation messages on buses and billboards.\n\"The goal is not to stop gambling entirely,\" says Massachusetts state Rep. Lindsay Sabadosa, a cosponsor of the bill.",
        "text": "As sports betting explodes, should states set more limits to stop gambling addiction?\n\ntoggle caption Karen Brown/NEPM\n\nIt's hard to promote moderation and financial discipline from the bowels of a casino.\n\nBut that's what Massachusetts state workers try to do every day, amid the clanging bells and flashing lights of the slot machines.\n\nThis story was produced in partnership with KFF Health News.\n\nAt the MGM Springfield in western Massachusetts, these workers, wearing green polos, stand outside their small office, right off the casino floor.\n\nAbove them the sign reads, \"GameSense,\" the state's signature program to curb problem gambling.\n\nA mounted screen cycles through messages such as \"Keep sports betting fun. Set a budget and stick to it.\"\n\nThe workers hand out free luggage tags and travel-size tissues in an effort to get people to stop and chat.\n\nIf they succeed, they give customers brochures with the state's gambling helpline number and website. They can even enroll them in a program, called Play My Way, that allows customers to set monthly spending limits on how much they gamble.\n\nSponsor Message\n\nOutside the casinos, GameSense is marketed on social media and on sportsbook apps and websites. Meanwhile, the state's Department of Public Health puts its own moderation messages on buses and billboards.\n\n\"That's a big movement in 12 years,\" says Mark Vander Linden, who oversees the GameSense program for Massachusetts.\n\nMassachusetts' first casino opened in 2015, and as the gaming industry grew, the state developed what it calls a \"responsible gaming\" program, funded by a surtax on gambling industry profits.\n\ntoggle caption Karen Brown/NEPM\n\nAt first, the state regulators tried various strategies to educate customers about the addictive nature of gambling, as well as the financial risks.\n\n\"It was much more about making sure that there are brochures that are available that explained the odds of whatever game it was,\" he says.\n\nSince then, Massachusetts has put in place additional regulations on a booming industry that now includes widespread sports betting. For example, there's no betting on Massachusetts college teams, and no gambling by credit card. All gambling companies have to allow customers to set voluntary limits and sign up for a \"voluntary self-exclusion list\" that bans them from casinos or sports betting over various time intervals.\n\nU.S. has no national gambling policy, unlike other countries\n\nSome states have set similar limits in an effort to curb problem gambling, but others have very few. In the absence of a nationwide policy, or a national gambling commission to oversee the industry, each state is on its own.\n\nSponsor Message\n\nNow a growing number of addiction researchers and policy makers say it's time to take bolder — and more unified — steps to combat gambling disorders. They point to the explosion of the gaming industry since 2018, when the U.S. Supreme Court opened the door for states to legalize sports betting and unleashed an aggressive new industry, now legal in 39 states. (Forty-eight states have legalized at least some form of gambling, including lotteries.)\n\nCompared to the U.S., several other countries have gone much further in regulating the gambling industry, and some experts in the U.S. are looking to them as potential models.\n\nFor example, Norway's government has a monopoly on all slot machines so it can control the types of games offered, and every gambler in the country is limited to losing only 20,000 kroner (about $2,000) a month.\n\nIn the United Kingdom, there's a new 5 pound limit (about $7) on every spin on a slot machine, and gambling companies are now subject to a 1 percent levy that goes into a fund for treatment and prevention of gambling disorders.\n\ntoggle caption Karen Brown/NEPM\n\nEarlier this year, a report published in the medical journal The Lancet called on international health leaders to act quickly on regulations before gambling disorders become widespread and common, and that much harder to stop.\n\nBut policy leaders point out that the U.S. has less appetite for corporate regulation than many other countries, especially in the Trump administration. At the same time, they warn that doing nothing could pose a serious public health threat, especially now that sports betting apps allow people to gamble anywhere and anytime.\n\nFears that more gambling means more addiction\n\nEven before the marriage of online gaming and cellphones, researchers had estimated 1% to 2% of Americans already had a gambling disorder, and another 8%of people were at risk of developing one.\n\nSponsor Message\n\nSome U.S. politicians fear the problem will only get worse.\n\n\"The sophistication and complexity of betting has become staggering,\" says Democratic U.S. Sen. Richard Blumenthal of Connecticut. \"And that's why we need protections that will enable an individual to say no.\"\n\nBlumenthal has co-sponsored the SAFE Bet Act, legislation that would impose federal standards on sports betting companies.\n\nThe bill proposes a ban on gambling ads during live sporting events, mandatory \"affordability checks\" for high-spending customers, limits on \"VIP\" membership schemes, a ban on AI tracking for marketing, and the creation of a national \"self-exclusion\" database, among other rules.\n\n\"States are unable to protect their consumers from the excessive and abusive offers, and sometimes misleading pitches,\" Blumenthal says. \"They simply don't have the resources or the jurisdiction.\"\n\ntoggle caption Karen Brown/NEPM\n\nThe gambling industry is strongly opposed to the SAFE Bet Act. Federal standards would be a \"slap in the face\" to state regulators, says Joe Maloney, a spokesperson for the American Gaming Association.\n\n\"You have the potential to just dramatically, one, usurp the states' authority and then, two, freeze the industry in place,\" he says.\n\n'Responsible gaming' is different from a public health approach\n\nNew regulations are also unnecessary, Maloney says. The industry acknowledges that gambling is addictive for some people, he says, which is why it developed an outreach/awareness initiative known as \"responsible gaming.\"\n\nThat includes messages on buses and billboards warning people to stop playing when it's no longer fun and reminding them the odds of winning are very low.\n\n\"There's very direct messages, such as – 'you will lose money here,'\" Maloney says.\n\nHe says his industry group does not collect data on whether those measures reduce addiction rates. But he says gambling restrictions are not the answer.\n\n\"If you suddenly start to pick and choose what can be legal or banned, you're driving bettors out of the legal market and into the illegal market,\" Maloney says.\n\nSponsor Message\n\nBut public health leaders say the industry's \"responsible gaming\" model just doesn't work.\n\n\"You need regulation when the industry has shown an inability and unwillingness to police itself,\" says Harry Levant, director of gambling policy for the Public Health Advocacy Institute at Northeastern University in Boston.\n\nOne reason the industry's approach is \"ethically and scientifically flawed\" is that it puts all the blame and responsibility on individuals with a gambling disorder, Levant says.\n\n\"You can't say to a person who is struggling with addiction, 'well just don't do that anymore,'\" Levant says.\n\nLevant comes to the issue from personal experience. He is in recovery from a gambling addiction himself. A former lawyer, Levant was convicted in 2015 for stealing clients' money to fund his betting habit. Since then, he has not only become an advocate for stronger regulations, but is a trained addiction therapist.\n\ntoggle caption Karen Brown/NEPM\n\nThe American Gaming Association says it supports treatment for gambling disorder, and helps pay for some referral and treatment services through state taxes. But Levant calls that \"the moral equivalent of Big Tobacco saying, 'Let us do whatever we want for our cigarettes, as long as we pay for chemotherapy and hospice.'\"\n\nInstead, Levant advocates for a public health approach that would help prevent addiction from the get-go. That means putting limits on marketing and on the types — and frequency — of gambling — for everyone, not just those already in trouble.\n\nCan lawmakers stop 'the worst excesses' before the next gambling trend?\n\nTo make his case, Levant opens his laptop and pulls up a corporate infomercial produced by SimpleBet, a DraftKings subsidiary.\n\nIn the video, the company boasts about getting more people to gamble on sports through what's called micro-betting during live games. \"We drive fan engagement by making every moment of every game a betting opportunity. Automatic, algorithmic, powered by machine learning and AI,\" the voiceover says.\n\nSponsor Message\n\nThat's the kind of constant engagement that promotes addiction, Levant says. (Contacted by NPR, DraftKings declined to comment.)\n\ntoggle caption Karen Brown/NEPM\n\nSome of those gambling mechanisms would be limited by the SAFE Bet Act, which Levant and his colleagues at the Public Health Advocacy Institute helped write.\n\nBut if the legislation doesn't get through the current regulation-averse Congress, then states need to take strong action on their own, Levant says.\n\nThe Massachusetts legislature is currently considering the Bettor Health Act, which would impose additional rules on sports betting companies.\n\n\"The goal is not to stop gambling entirely,\" says Massachusetts state Rep. Lindsay Sabadosa, a cosponsor of the bill. \"It's to stop the worst excesses of online sports betting.\"\n\nThe Massachusetts bill includes some components of the federal legislation, such as mandatory \"affordability checks.\" Those would cap how much money some gamblers can lose. Affordability checks are modeled on a pilot program in the United Kingdom.\n\n\"If you're only allowed to have two drinks, we know that you're not going to get drunk, right?\" says Sabadosa. \"If you're only allowed to gamble $100 a day because that's an affordable amount, you're not going to go broke. You're still going to be able to pay the rent.\"\n\nThe Bettor Health Act would also ban \"prop\" bets, which are wagers placed during a live game, like who makes the first shot in basketball, or who hits the first home run in baseball.\n\nBut state tax revenue from sports betting rose to $2.2 billion in 2023 — a welcome source of funding for struggling state budgets. Because of that, Levant fears that state legislatures will shy away from further regulation.\n\nStates may even be tempted by the promise of additional revenues from new types of gambling, such as \"i-gaming.\" That refers to online versions of roulette, blackjack and other casino-style games, playable at any hour, from the comfort of your own home.\n\nSponsor Message\n\nI-gaming is currently legal in only seven states, but pending legislation in other states, including Massachusetts, could expand its markets.\n\n\"We have empathy for how hard it is for states to balance their budgets in this current political environment,\" Levant says, \"but states are starting to recognize that the answer to that problem is not to further push a known addictive product.\"\n\nThis story comes from NPR's health reporting partnership with New England Public Media and KFF Health News."
    },
    {
        "url": "https://www.bbc.com/news/articles/cewnje717rqo",
        "title": "Just do it: Why I'm challenging Nike, Puma and Adidas over single shoes",
        "authors": null,
        "publish_date": null,
        "summary": "Now she's campaigning for big brands such as Nike, Adidas and Puma to sell single shoes rather than pairs.\nBBC Morning Live In recent years, shops have incorporated disability into their marketing, prominently featuring mannequins wearing running bladesAdidas, which equip the British Paralympic team, also do not sell single shoes online.\nPuma meanwhile, does not sell any single shoes in store or online and, like Decathlon, did not respond to a request for comment.\nWhile Nike and Adidas have made positive steps towards addressing the issue, Stef thinks sports brands should sell single shoes at all their shops and online as standard practice.\n\"It would be nice to be able to buy shoes that fit… [without] paying twice,\" he says.",
        "text": "Why I'm challenging Nike, Adidas and Puma over single shoes\n\n2 days ago Share Save Alex Taylor BBC News reporter Share Save\n\nBBC Morning Live Former Para-athletic world champion Stef Reid wants sport footwear companies to match their inclusive marketing with genuine action\n\nStef Reid grew up as a sports-obsessed child, dreaming of playing rugby internationally. But on the eve of her 16th birthday, her life changed forever. Severe propeller lacerations from a horrific boat accident left doctors with no choice but to amputate her right foot. Initially she continued to pursue rugby, but her agility and speed weren't the same and she grew tired of comparing her performance to when she had both feet. \"I didn't want to give up on my goal just because I was an amputee, but life is constantly changing and we have to update our goals instead of forcing them to work in a reality that no longer exists,\" she says. So she moved on from rugby and took up athletics. Using a light, springy carbon-fibre blade on her right leg, she eventually became a world champion Paralympic long jumper and sprinter for both Canada and Great Britain - winning medals, breaking records and receiving an MBE. She's now retired from professional sport, but has shown a similar adaptability and resilience in her new career which includes acting, modelling and broadcasting including competing in Dancing on Ice. Now she's campaigning for big brands such as Nike, Adidas and Puma to sell single shoes rather than pairs. In part it's about cost - high-end running shoes cost around £200, and when she was competing she only needed one but had to buy two, meaning she wasted hundreds of pounds on shoes she never wore.\n\nBut her biggest motivation - is the principle. Many of the big brands proudly display models with blades in their shop windows, but don't sell shoes individually for athletes like Stef. \"I loved the bladed mannequins, and I wish 15-year-old Stef had seen those. \"But now I want retailers to match their inclusive imagery with the actual buying experience\". Stef isn't alone. While she wears two shoes with her day-to-day prosthetic, many other amputees don't. And beyond disability, thousands of people whose feet are different sizes are also affected by having to buy two shoes of the same size rather than two singles.\n\nStef Reid Stef says global sports brands are yet to match their inclusive marketing with useful action for amputees needing single shoes\n\nNike launched a single shoe programme last year, letting customers buy one shoe at half price at select stores. However this is not clearly advertised, requires the customer to contact the care support team and is not available online. When Stef raised the issue, she was not pointed to the scheme but instead offered a one-time 15% discount. \"That's not much use in the long term, as I'm always going to have one foot\".\n\nBBC Morning Live In recent years, shops have incorporated disability into their marketing, prominently featuring mannequins wearing running blades\n\nAdidas, which equip the British Paralympic team, also do not sell single shoes online. However they say it is possible to buy a single shoe in some stores, depending on stock. The company added it is in the \"advanced stages\" of finalising a comprehensive policy. Puma meanwhile, does not sell any single shoes in store or online and, like Decathlon, did not respond to a request for comment. While Nike and Adidas have made positive steps towards addressing the issue, Stef thinks sports brands should sell single shoes at all their shops and online as standard practice.\n\nSmall steps\n\nSome smaller businesses and grassroots organisations are already proving it is possible.\n\nHigh street footwear company Schuh sells single shoes for half the price of a pair, while shoe chain Office also allows you to buy odd sized pairs of shoes through their outlet site. And then there's small scale solutions such as Jo's Odd Shoes, founded by Jo O'Callaghan who lost her right leg to complex regional pain syndrome. The condition makes it too painful to wear a prosthetic limb, leaving her, like many amputees, only needing one of a pair of shoes. She set up a Facebook Group where members could swap or donate spare shoes. Many retailers also donate shoes to the scheme. The items are free for members, aside from a small fee for postage and packaging.\n\nBBC Morning Live Jo, seen dealing with online orders, says her initiative offers her peace of mind in knowing that shoes will not go to waste\n\nIt's a service that air sport athlete Jack Pimblett has benefited from. Born with talipes, or club foot, which stunted the growth of his right foot and leg, he struggled to find two shoes which fitted well when he was younger. He often had to put cotton wool in his shoes to fill the extra space. As an adult, he manages by buying a combination of junior and adult shoe sizes - buying a right shoe in size 5 and a left shoe in size 7. But this imposes a significant financial strain, with Jack typically spending around £150 for two pairs of shoes. \"It would be nice to be able to buy shoes that fit… [without] paying twice,\" he says. Stef acknowledges the change she's calling for takes time and money, but urges firms to push forward. \"All it takes is that first step forward in the right direction,\" she says."
    },
    {
        "url": "https://www.theverge.com/news/788297/amazon-fall-2025-hardware-announcements-echo-alexa-kindle-ring",
        "title": "Amazon’s 2025 hardware event: the 8 biggest announcements",
        "authors": "Emma Roth",
        "publish_date": "2025-09-30",
        "summary": "Amazon just finished up its fall event, where it shared big updates across its entire hardware lineup.\nThey also come with Amazon’s AI-powered Alexa Plus assistant.\nImage: The Verge / AmazonAmazon is giving its budget-friendly smart speaker an upgrade with the Echo Dot Max.\nThe new device supports Alexa Plus but is available for $99.99, making it more expensive than the $49.99 Echo Dot.\nAlong with the many streaming apps you can use with the device, Amazon says it will soon support Xbox Gaming, Luna, and Alexa Plus.",
        "text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nPosts from this author will be added to your daily email digest and your homepage feed.\n\nAmazon just finished up its fall event, where it shared big updates across its entire hardware lineup. In addition to revealing new Echo hardware and Kindle Scribe upgrades, Amazon also took the wraps off refreshed Fire TV devices and a whole bunch more.\n\nHere are all the announcements Amazon made during the event.\n\nImage: Amazon\n\nAmazon debuted its latest Echo Show smart displays, with both the 8-inch and 11-inch models featuring a new design that places a slimmer screen atop an oblong speaker wrapped in knit fabric. Both displays have 13-megapixel cameras with a wide-angle view to better detect people in the room, and some upgrades to the Show UI make it easier to control multiple devices at the same time, too. They also come with Amazon’s AI-powered Alexa Plus assistant.\n\nThe Echo Show 11 costs $219.99 and has a 1080p display, while the Echo Show 8 is priced at $179.99 and has a 720p display.\n\nImage: The Verge / Amazon\n\nAmazon is giving its budget-friendly smart speaker an upgrade with the Echo Dot Max. The new device supports Alexa Plus but is available for $99.99, making it more expensive than the $49.99 Echo Dot. This upgraded device offers a more powerful speaker with three times the bass when compared to the base Echo Dot, and it also has higher-quality fabric, a better microphone array, and an updated design that places speaker controls and an LED light ring on the front.\n\nAmazon’s 2025 Echo Studio. Photo: Owen Grove / The Verge\n\nLike the Echo Dot Max, the $219.99 Echo Studio also puts touch controls and an LED ring light on the front of the device. Aside from this change, the Echo Studio is smaller than its predecessor and also offers support for spatial audio and Dolby Atmos.\n\nYou can also use the new Alexa Home Theater feature to link up to five Echo Studio or Echo Dot Max devices to create surround sound with Fire TV sticks.\n\nPhoto: Owen Grove / The Verge\n\nAmazon is launching three new Kindle Scribes, including one with a color display. The Kindle Scribe Colorsoft starts at $629.99, offering up to two weeks of battery life and the ability to highlight, draw, and write in an array of colors when it launches later this year.\n\nAside from the Kindle Scribe Colorsoft, Amazon is also launching an entry-level Scribe starting at $429.99, along with a mid-tier model with a front-lit display starting at $499.99. All of Amazon’s new e-readers feature an 11-inch screen with thinner bezels, a light design, and new AI features for summarizing your notes.\n\nImage: Amazon\n\nAmazon’s new Fire TV Omni QLED lineup features a revamped design with brighter displays and an upgraded processor that allows for faster performance. They also have support for Dolby Vision and HDR10 Plus, and can automatically adjust the display’s color based on the lighting in your room. The new Fire TV Omni QLED models come in sizes ranging from 50 to 75 inches and start at $479.99.\n\nAdditionally, Amazon revealed new 2- and 4-series Fire TVs, which have thinner metal bezels and a more powerful quad-core processor. They’re available from 32 inches to 55 inches and start at $159.99. All of Amazon’s new TVs have Alexa Plus on board, allowing you to ask the upgraded voice assistant for movie recommendations and sports scores, as well as to search for specific scenes across Prime Video.\n\nImage: Amazon\n\nAmazon’s new Fire TV Stick 4K Select runs on the company’s long-rumored Vega operating system, which enables better performance in addition to 4K video quality and support for HDR10 Plus. Along with the many streaming apps you can use with the device, Amazon says it will soon support Xbox Gaming, Luna, and Alexa Plus. The Fire TV Stick 4K Select costs $39.99 and is available for preorder today.\n\nImage: Amazon\n\nRing highlighted some new features coming to its cameras and doorbells, too, including an AI facial recognition capability that recognizes people at your door, Alexa Plus-powered doorbell greetings, as well as a Search Party feature that helps locate lost dogs in your neighborhood.\n\nAmazon’s Blink Arc camera.\n\nBlink has announced a new device called Arc, which comes equipped with two cameras that are combined for a 180-degree view. Blink stitches the footage from the two cameras together, eliminating the need to switch between multiple feeds.\n\nIn addition to the $99.99 Arc camera, Blink also revealed new Blink Outdoor 2K Plus and Blink Mini 2K Plus cameras, both of which offer 2K video resolution, upgraded audio, color night vision, and a two-way talking system with noise cancellation."
    },
    {
        "url": "https://hypebeast.com/2025/9/seiko-5-sports-bamford-limited-edition-release-info",
        "title": "Seiko and Bamford Debut Retro-Future Limited-Edition Seiko 5 Sports Watch",
        "authors": "Zoe Leung",
        "publish_date": "2025-09-30",
        "summary": "SummarySeiko and Bamford partnered for a limited-edition Seiko 5 Sports watchThe design has a “Retro Future” theme, with a bright blue skeleton dialLimited to 2,025 pieces, the watch will be available starting October 1, 2025Seiko has partnered with Bamford for their inaugural collaboration featuring a limited-edition Seiko 5 Sports SRPL95 watch.\nThe design centers on a “Retro Future” concept, blending design elements from two historic Seiko 5 Sports watches: a classic 1980s SKX and a 1960s model.\nHoused in a 42.5mm stainless steel case, Bamford’s signature touch emerges in the skeleton dial that exposes the automatic 4R36 caliber as well as its 41-hour power reserve.\nThe engraved caseback showcases a subtle retro motif, echoing mid-century Seiko graphics and transforms the watch into a rotating gallery that honors both brands’ storied pasts.\n$538 USD), the Seiko 5 Sports x Bamford Limited Edition is available in a limited run of 2,025 pieces and will be shoppable via Seiko’s UK webstore starting October 1, 2025.",
        "text": "Summary\n\nSeiko and Bamford partnered for a limited-edition Seiko 5 Sports watch\n\nThe design has a “Retro Future” theme, with a bright blue skeleton dial\n\nLimited to 2,025 pieces, the watch will be available starting October 1, 2025\n\nSeiko has partnered with Bamford for their inaugural collaboration featuring a limited-edition Seiko 5 Sports SRPL95 watch. The design centers on a “Retro Future” concept, blending design elements from two historic Seiko 5 Sports watches: a classic 1980s SKX and a 1960s model. Housed in a 42.5mm stainless steel case, Bamford’s signature touch emerges in the skeleton dial that exposes the automatic 4R36 caliber as well as its 41-hour power reserve. Set against a vibrant light blue dial plate, vivid colour accents frame the oversized indices, while also marking the unmistakable Bamford logo at 6 o’clock.\n\nBeyond the dial, every detail reinforces the timepiece’s artistic narrative. A uni-directional bezel and 22mm lug width ensure robust functionality, while the NATO strap’s metal loop bears Bamford’s insignia, all set against brushed and polished surfaces. The engraved caseback showcases a subtle retro motif, echoing mid-century Seiko graphics and transforms the watch into a rotating gallery that honors both brands’ storied pasts. Packaging arrives as a canvas of its own — a special edition box woven with graphic nods to 1960s Seiko promotional art and period-inspired typography.\n\nPriced at £400 GBP (approx. $538 USD), the Seiko 5 Sports x Bamford Limited Edition is available in a limited run of 2,025 pieces and will be shoppable via Seiko’s UK webstore starting October 1, 2025."
    },
    {
        "url": "https://www.fox5ny.com/news/nyc-queens-casino-proposal-steve-cohen-citi-field-metropolitan-park",
        "title": "Steve Cohen’s casino proposal near Citi Field gets approval",
        "authors": "Michael Stallone",
        "publish_date": null,
        "summary": "Only three downstate casino licenses will be granted by year's end.\nThe backstory:On Monday, a community advisory committee voted against a casino proposal in Coney Island, but approved the Bronx proposal.\nLast week, the committees approved two casino expansion plans for locations in Queens and Yonkers, bringing them one step closer to getting a commercial casino license.\nCommercial casino licenses would allow the locations to include live dealer games.\nThe New York State Gaming Commission will award three downstate licenses by the end of the year.",
        "text": "The Brief A key vote has determined if a casino near Citi Field in Queens can move forward. The Metropolitan Park project will advance to state-level review. Only three downstate casino licenses will be granted by year's end.\n\n\n\nA community advisory board has approved the idea of opening a casino next to Citi Field in Queens.\n\nNew York Mets team owner Steve Cohen is behind the Metropolitan Park project, along with Hard Rock. The proposal will now move to the state level for possible approval.\n\nThe vote was the last of the eight bids in the New York City area, four of which were denied. The New York State Gaming Commission will award three downstate licenses by the end of the year.\n\nThe backstory:\n\nOn Monday, a community advisory committee voted against a casino proposal in Coney Island, but approved the Bronx proposal.\n\nLast week, the committees approved two casino expansion plans for locations in Queens and Yonkers, bringing them one step closer to getting a commercial casino license.\n\nThe Queens Advisory Committee voted unanimously to approve the expansion plan at Resorts World Casino New York City. The casino's $5.5 billion proposal includes plans for thousands of slot machines and new hotel rooms, hundreds of gaming tables and dozens of green spaces.\n\nA Yonkers committee similarly approved plans for expansion at MGM Empire City. Their proposal includes plans for a new sports book and high-limit lounge, and a full renovation of the gaming floor.\n\nBoth facilities are currently operating as partial casinos. Commercial casino licenses would allow the locations to include live dealer games.\n\nThe New York State Gaming Commission will award three downstate licenses by the end of the year."
    },
    {
        "url": "https://petapixel.com/2025/09/30/trial-opens-into-death-of-sports-photographer-killed-by-runaway-bike/",
        "title": "Trial Opens into Death of Sports Photographer Killed by Runaway Bike",
        "authors": "Pesala Bandara",
        "publish_date": "2025-09-30",
        "summary": "A trial is underway over the death of a sports photographer who was killed by a runaway bike while covering a motorcycle racing competition.\nPhotographer Simon Mitchell was killed when a riderless motocross bike flew off the track and hit him during a British Motocross Championship event in Swindon, U.K., in May 2023.\nA rider took a jump and lost control of his bike, which broke through a hay bale barrier, striking and killing the photographer.\nThe Langrish Motorcycle Club has denied the charge, and its solicitor entered a not guilty plea.\nMitchell, remembered as a dedicated motocross photographer and supporter, was described by colleagues as kind and generous.",
        "text": "A trial is underway over the death of a sports photographer who was killed by a runaway bike while covering a motorcycle racing competition.\n\nPhotographer Simon Mitchell was killed when a riderless motocross bike flew off the track and hit him during a British Motocross Championship event in Swindon, U.K., in May 2023.\n\nA rider took a jump and lost control of his bike, which broke through a hay bale barrier, striking and killing the photographer. Another man, a marshal in his 60s, was also badly hurt in the same accident.\n\nMitchell and the marshal were behind a specific marshal point and not among any of the event’s roughly 10,000 spectators. The racer who fell off his bike was reportedly unhurt, and the event was immediately stopped after the incident.\n\nMitchell, who was in his 50s, was described as a “passionate photographer” who was a popular part of the national off-road motorcycle racing competition.\n\nA trial has now started into the death of Mitchell two years after the incident, according to a report by local news outlet Swindon Advertiser. The Langrish Motorcycle Club, which was running the event, is accused of not following proper health and safety rules to protect people at the track. Prosecutors say the club, as the organizer in charge of the site, should have made sure the venue was as safe as reasonably possible.\n\nThe charge says the motorcycle club was responsible for the motocross track and failed to take proper steps to make sure the site, the areas people could use to get around it, and any equipment there were safe and did not put people at risk.\n\nThe Langrish Motorcycle Club has denied the charge, and its solicitor entered a not guilty plea. The case will now move to Swindon Crown Court in late October. Mitchell, remembered as a dedicated motocross photographer and supporter, was described by colleagues as kind and generous. A fundraising campaign after his death helped cover his funeral costs and supported local charities."
    },
    {
        "url": "https://www.businessinsider.com/doordashs-dot-delivery-robot-bets-on-cuteness-2025-9",
        "title": "DoorDash says its new self-driving delivery robot has a special feature: Cuteness",
        "authors": "Alex Bitter",
        "publish_date": null,
        "summary": "DoorDash has a robot that can traverse sidewalks and roads to deliver dinner to your door.\nOn Tuesday, DoorDash unveiled Dot, its latest self-driving delivery robot.\nLook online, and you'll find evidence that DoorDash might be onto something with its focus on cuteness.\nDot is the latest self-driving vehicle to take to the streets and perform a task that's currently done by human gig workers.\nVideos that DoorDash showed at the event to unveil Dot showed the robot traveling in the bike lanes on roads.",
        "text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nDoorDash has a robot that can traverse sidewalks and roads to deliver dinner to your door.\n\nImportantly, the company says, it's also cute.\n\nOn Tuesday, DoorDash unveiled Dot, its latest self-driving delivery robot. The vehicle sports a red exterior, can carry up to 30 pounds of cargo, and is roomy enough to fit up to six pizza boxes at once. Dot also includes lidar sensors and cameras that are already helping it navigate streets and sidewalks in parts of Phoenix as it makes deliveries from restaurants and Dashmart.\n\nDot has LED lights that look like eyes and the ability to greet restaurant workers with an \"Oh, hello!\" as it pulls up to retrieve an order, executives at DoorDash said.\n\n\"Beyond the tech details, we've also put a lot of thought into the personality and character of Dot,\" Ashu Rege, vice president of autonomy and head of DoorDash Labs, said at an event in San Francisco on Monday to unveil the robot. \"We really love how cute this little robot is.\"\n\nLook online, and you'll find evidence that DoorDash might be onto something with its focus on cuteness.\n\nOne video posted last month on TikTok shows a robot from startup Coco Robotics — which has worked with DoorDash on some autonomous deliveries — trying to cross a street. In the video, a woman can be heard cheering the robot on.\n\n\"Oh my god, don't hit Coco,\" the woman says in the video as the robot avoids colliding with cars. \"Coco just wants to cross the street.\"\n\nDot is the latest self-driving vehicle to take to the streets and perform a task that's currently done by human gig workers.\n\nEarlier this year, Uber started offering rides in Waymo's autonomous vehicles in Atlanta and Austin. Waymo has offered rides in other cities, such as Phoenix and San Francisco, for years through its own app.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nDelivering food and other goods through self-driving vehicles is harder, as DoorDash has said before. While rideshare riders can walk up or down a block to get to their robotaxi, getting a burrito or salad into such a vehicle requires more coordination with restaurant workers.\n\nAt DoorDash's San Francisco headquarters on Monday, company executives said that Dot's design attempts to make that coordination easier.\n\nWhile existing delivery robots are limited to driving on sidewalks, for example, Dot can switch between hitting speeds of up to 20 miles an hour on roads and slower rates for navigating sidewalks. Videos that DoorDash showed at the event to unveil Dot showed the robot traveling in the bike lanes on roads.\n\nThe vehicle weighs 350 pounds, according to DoorDash. It stands four and a half feet tall and, at 29 inches, is slightly wider than many baby strollers.\n\nWith those dimensions, Dot can pull right up to a restaurant entrance, allowing a worker to place orders directly inside its protective shell. The robot's size means that it could also fit through many doorways in future use cases, Rege said.\n\n\"It's a much different technical and operational challenge than ride-hail,\" Stanley Tang, one of DoorDash's co-founders and its chief product officer, said. \"People want deliveries right to the door. Solving that last 10 feet isn't optional.\""
    },
    {
        "url": "https://www.npr.org/2025/09/30/nx-s1-5557394/mlb-2025-playoffs-yankees-red-sox-brewers-padres-mariners",
        "title": "The MLB postseason begins Tuesday. Who should you root for to win a World Series?",
        "authors": "Becky Sullivan",
        "publish_date": "2025-09-30",
        "summary": "Who should you root for to win a World Series?\nThat means it's anybody's World Series title to claim — including, potentially, one of three franchises that have never before won the Fall Classic.\nOf the five teams that have never won a World Series, the Seattle Mariners are the only to have never even reached the Fall Classic.\nTwo other teams in the postseason have also never won the World Series.\ntoggle caption Steph Chambers/Getty ImagesThe Los Angeles Dodgers, their 2024 World Series rings still fresh from the jeweler, are a good choice too.",
        "text": "The MLB postseason begins Tuesday. Who should you root for to win a World Series?\n\ntoggle caption Steph Chambers/Getty Images\n\nOctober baseball is here a day early, with Major League Baseball's first postseason games scheduled to begin Tuesday afternoon.\n\nIt's a wide-open field this postseason with no clear favorites like last year's Los Angeles Dodgers. No team in baseball this year won more than 97 games, making the 2025 Milwaukee Brewers the losing-est winningest team in baseball since 2013 (not counting the pandemic-shortened 2020 season).\n\nThat means it's anybody's World Series title to claim — including, potentially, one of three franchises that have never before won the Fall Classic. We've got the coasts: New York, Los Angeles, Seattle, San Diego, Boston, Philadelphia. And we've got the Midwest: Chicago, Milwaukee, Cleveland, Detroit. We've even got Canada! (Sorry, Southerners.)\n\nStill, with 12 teams in the mix, it can be a lot to sort out which to root for. Let us help.\n\nDo you like rooting for a team that has never been here before? (In other words, are you a human with a heart?)\n\nOf the five teams that have never won a World Series, the Seattle Mariners are the only to have never even reached the Fall Classic. We're talking about fans who have rooted for this team for 49 long seasons, watching as literally every other active franchise has taken a swing at a title. For a particularly bad 20-year stretch that ended in 2022, the M's had the ignominious dishonor of owning the longest postseason drought of any of the big four North American men's professional sports.\n\nSponsor Message\n\nBut the mood is suddenly sunny in Seattle, where catcher — and perhaps AL MVP — Cal Raleigh has had a historic year, becoming just the seventh player in baseball history to hit 60 home runs in a single season. Ownership bought big at the trade deadline and in September, the Mariners turned into the second-hottest team in baseball to claim an AL West division title for the first time since 2001.\n\nThe Mariners' No. 2 seed means a ticket straight to the ALDS. They'll face the winner of the Wild Card Series between the Detroit Tigers and Cleveland Guardians, both of which — despite their own long-running title droughts — have at least played in a World Series (and in the last 13 years to boot).\n\ntoggle caption John Fisher/Getty Images\n\nSeattle's a no-go, but you otherwise dig that kind of underdog vibe?\n\nGood news. Two other teams in the postseason have also never won the World Series. You can choose between the San Diego Padres, who haven't been back to the World Series since they lost in 1998, or the Milwaukee Brewers, who haven't returned since their last try 43 years ago in 1982. Fans of the Brewers and the Padres have suffered too!\n\nBoth teams have become playoff regulars in recent years but have yet to get over the hump. The Brewers emerged in July and August as baseball's hottest team. At $121 million, they are in the lowest third of payrolls in baseball, dwarfed by big spenders and fellow National League contenders like the Los Angeles Dodgers and Philadelphia Phillies. The Padres are bigger spenders, and that money has brought them some of the game's biggest stars, including outfielder Fernando Tatis Jr. and third baseman Manny Machado — but they keep running into their rivals, the Dodgers, in the postseason. (That won't happen this year unless both teams reach the NLCS.)\n\nSponsor Message\n\nOkay, enough of the underdogs. How about a good, old-fashioned rivalry?\n\nThe New York Yankees and Boston Red Sox used to be the most toxic rivalry in baseball. (The Dodgers and Padres have taken that crown for now; last year's poisonous NLDS will be tough to top.) But they have a chance to reclaim their crown when they meet for a best-of-three series in this year's Wild Card round.\n\ntoggle caption Kent J. Edwards/Getty Images\n\nIt doesn't matter too much which team you choose. This is your chance to embrace the dark side. The Yankees are the Evil Empire, of course, but don't discount Boston. The Curse of the Bambino is way, way back in the rearview mirror these days, and the Red Sox have won four World Series in the past 21 years, and while yes, we are only talking about baseball, it's worth the reminder that seemingly every other Boston pro sports team has won at least one title since then too. (Honestly, this is making the Yankees seem long-suffering by comparison.)\n\nThe Yankees have a towering lineup, anchored by the otherworldly Aaron Judge who turned in yet another incredible season. His stats: .331 batting average, .457 on-base percentage, 1.144 OPS, plus 53 home runs — something he's now doing with such regularity that it's almost becoming boring. The Red Sox bring a spottier lineup but better pitching, especially in starter Garrett Crochet and closer Aroldis Chapman, who has posted the best ERA of his career in his [checks notes] age 37 season.\n\nDo you love hitting for contact?\n\nOnly seven players finished the season with a batting average of .300 or higher — and the Toronto Blue Jays, the AL's top seed, have two of them, shortstop Bo Bichette and designated hitter George Springer. Add in first baseman Vladimir Guerrero Jr. (.292) and catcher Alejandro Kirk (.282) and the Blue Jays boast four players hitting .280 or higher. The next-most is just two.\n\nSponsor Message\n\nIt's not small ball, exactly, that the Blue Jays play. (Their 77 stolen bases this season was third-lowest in the majors, and most playoff teams hit more sacrifice flies than Toronto.) But the team led the league in batting average, hits and on-base percentage. They were second-to-last in strikeouts. Other teams hit more home runs and scored more runs, but the Blue Jays got men on base a ton. Now that's baseball.\n\nDo you just want to root for a winner?\n\nThe Philadelphia Phillies could be your team. This team is a powerhouse: slugger Kyle Schwarber (56 home runs), shortstop Trea Turner (.304 batting average), outfielder Harrison Bader (who has hit .305 since joining the Phillies in a trade), first baseman Bryce Harper and outfielder Nick Castellanos (75 and 72 RBIs, respectively). Even though they lost their ace starter Zack Wheeler to injury in August, this is still a great team that can crush anyone on any day.\n\ntoggle caption Steph Chambers/Getty Images\n\nThe Los Angeles Dodgers, their 2024 World Series rings still fresh from the jeweler, are a good choice too. The Dodgers are dealing with some injuries, including to catcher Will Smith, but what team is 100% healthy? And this top of the order will never not be crazy: Shohei Ohtani, Mookie Betts, Freddie Freeman, all three of them MVPs.\n\nSince he returned to the mound in July after elbow surgery, the two-way phenom Ohtani has posted a 2.87 ERA as a pitcher, the second-best of his career. Yet Ohtani had to use his limited appearances this year as a sort of rehab assignment, usually pitching just a few innings, and he only lasted a full six innings for the first time last week.\n\nThat prompted questions for some about how Ohtani might fit in a postseason strategy. On Monday, his teammate Betts dismissed those concerns.\n\n\"I think with him probably being the best player in the world, he can fit in wherever he wants to fit in,\" Betts told reporters. \"Whenever he feels like he needs to go in and pitch, I'm pretty positive nobody with a Dodgers uniform will say no.\"\n\nSponsor Message\n\nOr do you just want to watch some great young players?\n\nThen tune in to it all. Don't miss the Detroit Tigers ace Tarik Skubal, who is at the peak of his powers and looks destined to win the second Cy Young with his career-best 2.21 ERA. The Chicago Cubs are a likable bunch, with center fielder Pete Crow-Armstrong, who's due for a bounceback after cooling off from a hot start in the second half. And the Cincinnati Reds have one of the most electric players in the sport in shortstop Elly de la Cruz, who is making his playoff debut in a Wild Card series against the Dodgers. You can't go wrong."
    },
    {
        "url": "https://clutchpoints.com/nba/los-angeles-clippers/clippers-rumors-ex-staffer-scathing-take-kawhi-leonard-deal",
        "title": "Clippers rumors: Ex-staffer drops scathing take on shady Kawhi Leonard deal",
        "authors": "Rishav Bhat",
        "publish_date": "2025-09-30",
        "summary": "The Los Angeles Clippers have for weeks been rocked by the Aspiration-Kawhi Leonard saga.\nPablo Torre, who initially brought the story out, has now revealed further details about Steve Ballmer’s involvement in the alleged cap circumvention.\n“The world in Clipperland revolves around Kawhi Leonard and the moon is Dennis Robertson.\nThere is no way the Clippers did not know about this deal.\nThe journalist was almost appalled at the ease with which he was able to unearth scathing details about the controversy.",
        "text": "The Los Angeles Clippers have for weeks been rocked by the Aspiration-Kawhi Leonard saga. Pablo Torre, who initially brought the story out, has now revealed further details about Steve Ballmer’s involvement in the alleged cap circumvention.\n\nTorre revealed that, according to a former Clippers official, there was simply no way Ballmer did not know about the nature of the payments he had made to Aspiration.\n\n“The world in Clipperland revolves around Kawhi Leonard and the moon is Dennis Robertson. There is no way the Clippers did not know about this deal. And they pointed straight to Steve Ballmer and the President of Basketball Operations, Lawrence Frank, the innermost circle who handled the most sensitive issues around one of the most delicate superstars that anyone has managed in professional sports,” Torre said on the latest episode of Pablo Torre Finds Out.\n\nHowever, the more scathing observation came out when Torre pointed out further payments made by the Ballmer Group, specifically one made back in 2022. Torre claimed that, according to the Group’s website, specifically its “Our Grants” section, a $1.875 million grant was given to a “Golden State Opportunity Foundation,” which was created by Joe Sanberg.\n\nArticle Continues Below\n\nSanberg, a co-founder of Aspiration, pleaded guilty to defrauding multiple investors and lenders of a total of $248 million in August 2025.\n\n“And so just to set the scene, this is all about Kawhi Leonard's second-ever payment of $1.75 million that was due from aspiration at the end of September 2022. But of course, September 2022 came and went, October 2022 came and went,” Torre continued, effectively suggesting that the $1.875 million grant was merely a creative way to cover the payments that were eventually made to Kawhi Leonard by Aspiration.\n\nTorre went on to reveal text messages from Impact Sports’ Mitch Frankel, who previously worked with Kawhi, asking for payments from Mike Shakaro, who was Aspiration’s chief legal officer and chief compliance officer at the time. The journalist was almost appalled at the ease with which he was able to unearth scathing details about the controversy.\n\nHe claimed that details about Joe Sanberg’s involvement in The Golden State Opportunity Foundation were visible on its website as recently as November 2024, something he verified on the Internet Archive."
    }
]